sysbench/read_only_run_16.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 269.05 qps: 4317.71 (r/w/o: 3778.21/0.00/539.50) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 224.29 qps: 3586.39 (r/w/o: 3137.62/0.00/448.77) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 180.90 qps: 2891.64 (r/w/o: 2530.53/0.00/361.10) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 190.10 qps: 3044.66 (r/w/o: 2664.05/0.00/380.61) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 193.79 qps: 3104.00 (r/w/o: 2716.32/0.00/387.69) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 182.40 qps: 2914.07 (r/w/o: 2549.07/0.00/365.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 199.91 qps: 3199.18 (r/w/o: 2799.37/0.00/399.81) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 194.80 qps: 3121.26 (r/w/o: 2731.67/0.00/389.60) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 192.20 qps: 3072.73 (r/w/o: 2688.34/0.00/384.39) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 199.21 qps: 3189.61 (r/w/o: 2791.49/0.00/398.11) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 196.90 qps: 3146.83 (r/w/o: 2752.83/0.00/394.00) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 165.90 qps: 2655.12 (r/w/o: 2323.33/0.00/331.79) lat (ms,95%): 127.81 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 190.60 qps: 3047.94 (r/w/o: 2666.64/0.00/381.31) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 194.80 qps: 3117.91 (r/w/o: 2728.51/0.00/389.40) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 188.70 qps: 3013.61 (r/w/o: 2636.71/0.00/376.90) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 193.30 qps: 3101.57 (r/w/o: 2714.27/0.00/387.30) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 196.20 qps: 3134.26 (r/w/o: 2742.55/0.00/391.71) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 207.50 qps: 3316.65 (r/w/o: 2901.36/0.00/415.29) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 171.60 qps: 2753.65 (r/w/o: 2410.04/0.00/343.61) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 176.30 qps: 2819.16 (r/w/o: 2466.66/0.00/352.49) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 198.20 qps: 3169.64 (r/w/o: 2773.15/0.00/396.49) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 168.60 qps: 2697.53 (r/w/o: 2360.52/0.00/337.00) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 186.40 qps: 2986.26 (r/w/o: 2613.35/0.00/372.91) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 174.30 qps: 2788.39 (r/w/o: 2439.69/0.00/348.70) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 174.90 qps: 2796.88 (r/w/o: 2447.28/0.00/349.60) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 192.00 qps: 3071.89 (r/w/o: 2687.79/0.00/384.10) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 178.60 qps: 2861.06 (r/w/o: 2503.77/0.00/357.30) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 163.60 qps: 2612.21 (r/w/o: 2285.01/0.00/327.20) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 183.50 qps: 2938.75 (r/w/o: 2571.75/0.00/367.01) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 177.80 qps: 2838.58 (r/w/o: 2483.08/0.00/355.50) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            799120
        write:                           0
        other:                           114160
        total:                           913280
    transactions:                        57080  (190.22 per sec.)
    queries:                             913280 (3043.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0760s
    total number of events:              57080

Latency (ms):
         min:                                   27.47
         avg:                                   84.10
         max:                                  350.42
         95th percentile:                      114.72
         sum:                              4800673.12

Threads fairness:
    events (avg/stddev):           3567.5000/9.16
    execution time (avg/stddev):   300.0421/0.02